#包含 <stdio.h>

构 点 { 整 x; 整 y; };

函数 整 主(空) {
    整 ia[6]; ia[0] = 10; ia[1] = 20; ia[2] = 30; ia[3] = 40; ia[4] = 50; ia[5] = 60;
    整 *pa[2]; pa[0] = &ia[0]; pa[1] = &ia[3];

    字 ca[8]; ca[0] = 65; ca[7] = 72;
    字 *cp[2]; cp[0] = &ca[0]; cp[1] = &ca[7];

    构 点 sa[4]; sa[0].x = 1; sa[1].x = 2; sa[2].x = 3; sa[3].x = 4;
    构 点 *sp[2]; sp[0] = &sa[0]; sp[1] = &sa[2];



    格式化 "S1=%d S2=%d S3=%d SP=%d\n",
        (字*)&sa[1] - (字*)&sa[0], (字*)&sa[2] - (字*)&sa[0], (字*)&sa[3] - (字*)&sa[0],
        (字*)sp[1] - (字*)sp[0];
    返 0;
}
